# SQL Assignment

SQL is the language of relational databases. It's important to know how to query and manipulate structured data so that when you end up building your own database, you have an idea of how to use it. In this project, we'll practice writing SQL queries for the iMDb database.

This notebook will include the prompts for you to write the SQL queries to get the desired data. At the end, there is a section for you to see if the queries make sense or not.

## Getting started

Confirm that you can see 'SQL_Assignment.ipynb' and 'database.db' in the Jupyter Lab sidebar. If so, then you're ready to go.

## **SQL Queries**

This assignment consists of a set of prompts for which you should write an SQL query to get the appropriate results from "database.db". There are three parts of the assignment. The query you have to write will increase in complexity in each section.

We have written a helper function for you that conveniently returns results as a [pandas dataframe](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html). Make sure that you run the following cell before trying to run any subsequent cells, as otherwise the environment will not register this helper function:

In [4]:
import sqlite3
import pandas as pd
def query_sql(query):
    if query.isspace():
        return "An empty query won't find anything!"
    r = pd.read_sql(query, sqlite3.connect('database.db'))
    return r

You can pass an SQL query to this helper function as a string, and it will return a dataframe. For example, the following query returns the names of each of the tables in the database:

In [5]:
pd.set_option('display.max_colwidth', None)
query_sql("SELECT sql FROM sqlite_master WHERE type='table';")

                                                                                                                                                   sql
0                                               CREATE TABLE names(nconst text primary key, primary_name text, birth_year integer, death_year integer)
1                                                                    CREATE TABLE ratings(tconst text primary key, avg_rating real, num_votes integer)
2                 CREATE TABLE crews(id integer primary key autoincrement, tconst text, director text, foreign key(director) references names(nconst))
3                                                                                                               CREATE TABLE sqlite_sequence(name,seq)
4  CREATE TABLE titles(tconst text primary key, type text, primary_title text, original_title text, start_year int, end_year int, runtime_minutes int)
5                                                                       CREATE TABLE title_genres(tconst text, genre text, primary key(tconst, genre))

There are 5 relevant tables in this assignment, which has table and column names as follow:
- `names` : a table containing director's name and their details
    - `nconst` : a text representing the unique id of each director's name
    - `primary_name` : a text referring to the primary name of the director
    - `birth_year` : an integer representing the year of birth of the director
    - `death_year` : an integer representing the year of death of the director
- `ratings` : a table representing the ratings of the movies
    - `tconst` : a text representing the unique id of each movie's name
    - `avg_rating` : a number representing the average ratings of the movie
    - `num_votes` : an integer representing the number of votes placed on the specific movie
- `crews` : a table showing which movie is directed by which director
    - `id` : The auto-increasing id for each movie-director pairing 
    - `tconst` :  a text representing the unique id of each movie's name (foreign key from tconst in titles)
    - `director` : a text representing the unique id of each director's name (foreign key from nconst)
- `titles` : a table displaying the name of the movie
    - `tconst` : a text representing the unique id of each movie's name
    - `type` : a type of media (all are "movie" in this case)
    - `primary_title` : a text representing the titles of the movie 
    - `original_title` : a text representing the "original" titles of the movie (in case of foreign movie)
    - `start_year` : an integer showing the year the movie starts in the theatre
    - `runtime_minutes` : an integer showing the duration of movie show
- `title_genres` : a table showing the genre of the movie
    - `tconst` : a text representing the unique id of each movie's name
    - `genre` : a text representing the genre of the movie

Here is another query that retrieves all of the rows in the `titles` table:

In [6]:
query_sql("SELECT * from titles")

,tconst,type,primary_title,original_title,start_year,end_year,runtime_minutes
0,tt8831362,movie,Oronnonnara Pranayakadha,Oronnonnara Pranayakadha,2019.0,None,131.0
1,tt8831996,movie,Christianity of Egypt,Christianity of Egypt,2018.0,None,60.0
2,tt8832030,movie,The Goumada,The Goumada,NaN,None,NaN
3,tt8832036,movie,The Milwaukee Cannibal,The Milwaukee Cannibal,NaN,None,NaN
4,tt8832044,movie,Régénération,Régénération,2018.0,None,86.0
...,...,...,...,...,...,...,...
19889,tt9916622,movie,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015.0,None,57.0
19890,tt9916680,movie,De la ilusión al desconcierto: cine colombiano 1970-1995,De la ilusión al desconcierto: cine colombiano 1970-1995,2007.0,None,100.0
19891,tt9916706,movie,Dankyavar Danka,Dankyavar Danka,2013.0,None,NaN
19892,tt9916730,movie,6 Gunn,6 Gunn,2017.0,None,116.0
19893,tt9916754,movie,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013.0,None,49.0

You're now ready to start the assigment!

## **Part 1:**

1. Write a SQL query to find `primary_title` of top 10 movies which have received an `avg_rating` of more than or equal to 8.5, or have been voted by more than or equal to 1000000 people. Your results should be sorted by the average rating in descending order.

In [16]:
## Answer for Part 1 Question 1
p1q1 = """
    SELECT t.primary_title
    FROM titles t
    JOIN ratings r ON t.tconst = r.tconst
    WHERE r.avg_rating >= 8.5 OR r.num_votes >=1000000
    ORDER BY r.avg_rating DESC
    LIMIT 10
"""
# For testing
query_sql(p1q1)

                     primary_title
0                       Magnificus
1                        Here I Am
2             Last Night in Rozzie
3                        Royal Red
4    Spoons: A Santa Barbara Story
5  Kaye Ballard - The Show Goes On
6           As If They Were Angels
7                         Route 66
8                  Waiting for you
9          Higgi, Inspiring Voices

2. Write a SQL query that gets the director’s primary_name for the movie 'Poeta'.

In [25]:
## Answer for Part 1 Question 2
p1q2 = """
SELECT n.primary_name
FROM titles t
JOIN crews c ON t.tconst = c.tconst
JOIN names n ON n.nconst = c.director
WHERE t.primary_title = 'Poeta'
"""

# For testing
query_sql(p1q2)

     primary_name
0  Jeral Clyde II

3. Write a SQL query that returns the primary_name of directors and count of titles directed by each director. Results should be ordered by the count of titles in descending order

In [31]:
## Answer for Part 1 Question 3
p1q3 = """
SELECT n.primary_name, COUNT(distinct t.tconst) as title_count
FROM names n
JOIN crews c ON c.director = n.nconst
JOIN titles t ON t.tconst = c.tconst
GROUP BY n.nconst, n.primary_name
ORDER BY title_count DESC
"""

# For testing
query_sql(p1q3)

           primary_name  title_count
0      Satoru Kobayashi          146
1           Kinya Ogawa          144
2         Kaoru Umezawa           90
3       Mamoru Watanabe           82
4           Minoru Inao           73
...                 ...          ...
14809      Vincent Lenk            1
14810      Amedeo Pesce            1
14811      Eric Overton            1
14812     Calan Scherer            1
14813       Ryan Manley            1

[14814 rows x 2 columns]

4. Write a SQL query that returns the different genres of all the movies and average runtime of all genres.

In [34]:
## Answer for Part 1 Question 4
p1q4 = """
SELECT g.genre, AVG(t.runtime_minutes) as runtime
FROM title_genres g
JOIN titles t ON t.tconst = g.tconst
GROUP BY g.genre
ORDER BY t.runtime_minutes DESC
"""

# For testing
query_sql(p1q4)

          genre     runtime
0        Comedy   95.484451
1       Romance  102.811355
2   Documentary   76.538312
3        Family   94.069536
4         Drama   99.939870
5           War   95.030000
6       Musical  111.574468
7         Sport   93.576271
8        Horror   87.823038
9     Adventure   91.892638
10      History   88.630824
11    Animation   83.378641
12         News   69.692308
13        Short   44.000000
14      Western   95.419355
15     Thriller   96.827703
16    Talk-Show   77.000000
17       Sci-Fi   92.612022
18   Reality-TV   77.000000
19      Mystery   93.431373
20        Music   90.629108
21      Fantasy   92.943548
22        Crime  101.130435
23    Biography   86.621118
24       Action  102.429310

5. Write a SQL query that finds primary_name of directors who have directed movies that received an average rating less than or equal to 5.

In [44]:
## Answer for Part 1 Question 5
p1q5 = """
SELECT DISTINCT(n.primary_name)
FROM names n
JOIN crews c ON n.nconst = c.director
JOIN ratings r ON r.tconst = c.tconst
WHERE r.avg_rating <= 5
ORDER BY n.primary_name
"""

# For testing
query_sql(p1q5)

           primary_name
0          A. Venkatesh
1            A.L. Vijay
2           A.R. Mukesh
3                 Aadhi
4       Aaron B. Koontz
...                 ...
1214      Ángeles Reiné
1215      Åke Lundström
1216        Çagatay Düz
1217  Étienne Chatiliez
1218           Ömer Can

[1219 rows x 1 columns]

## **Part 2:**

1. Write a SQL query that returns primary_title and start_year of movies whose titles begin with 'The' and were relased in a leap year.

In [93]:
## Answer for Part 2 Question 1
p2q1 = """
SELECT primary_title, start_year
FROM titles
WHERE primary_title LIKE 'The%'
AND (
(start_year % 4 == 0 AND start_year % 100 != 0) 
OR (start_year % 400 = 0)
)
"""

# For testing
query_sql(p2q1)

                         primary_title  start_year
0     The Maid of the Blind Master (V)        2016
1                  The Imprisoned Love        2016
2    The Lover of a Capricious Painter        2016
3                             The Love        2016
4                           The Uncles        2004
..                                 ...         ...
196         The Immortal Wars: Rebirth        2020
197                      The Robinsons        2020
198       The Secret of the Red Spring        1992
199                         The Saving        2020
200                The Marriage Escape        2020

[201 rows x 2 columns]

2. Write a SQL query that returns the primary_title and start_year of movies that were released 19 years after the birth year of Walt Disney. (Hint: the CAST function may come in handy)

In [91]:
## Answer for Part 2 Question 2
p2q2 = """
WITH disney AS (
SELECT CAST(birth_year AS INTEGER) AS birth_year
FROM names
WHERE primary_name = 'Walt Disney'
)
SELECT t.primary_title, t.start_year
FROM titles t, disney d
WHERE CAST(t.start_year AS INTEGER) = d.birth_year + 19
ORDER BY t.primary_title
"""

# For testing
query_sql(p2q2)

                                primary_title  start_year
0   Asiatische Liebe oder Der Meteor im Osten        1920
1                           Das Haus der Lüge        1920
2                  Der Ring des Cesare Borgia        1920
3                       Die Welt des Scheines        1920
4                                Fata Morgana        1920
5                                   Getäuscht        1920
6                         Ihre zwei Buckligen        1920
7                      Mann, Weib und Energie        1920
8                        Mysterien des Lebens        1920
9                 Olly und derjenige, welcher        1920
10                    Olly zieht die Hosen an        1920

3. Write a SQL query that finds the primary_title, start_year and runtime_minutes of all shows whose runtime_minutes have exceeded the average runtime minutes of movies released in the same year. Results should be ordered by start year ascending and runtime minutes descending.

In [69]:
## Answer for Part 2 Question 3
p2q3 = """
WITH yearly AS (
SELECT start_year, AVG(runtime_minutes) AS avg_runtime
FROM titles
GROUP BY start_year
)
SELECT t.primary_title, t.start_year, t.runtime_minutes
FROM titles t
JOIN yearly y ON t.start_year = y.start_year
WHERE t.runtime_minutes > y.avg_runtime
ORDER BY t.start_year ASC, t.runtime_minutes DESC;
"""
# For testing
query_sql(p2q3)

,primary_title,start_year,runtime_minutes
0,La guerra de África,1926,75
1,Ninna nanna delle dodici mamme,1930,92
2,Mabuta no haha,1931,86
3,Haha no koibumi,1935,106
4,Keiko ogi,1935,100
...,...,...,...
4346,Adam The First,2022,214
4347,English Outlaw: The Story of Dick Turpin,2022,200
4348,"Exist, Not Exist: Zero Tolerance for Silence",2022,122
4349,Fiona,2022,119
4350,King Street,2023,105

## **Part 3:**

1. Write a SQL query that finds primary_title, avg_rating and reviews of 20 movies. The reviews depend on average rating. A movie with rating less than or equal to 3 should be reviewed as ‘poor’. A movie with rating greater than 3 and less than or equal to 6 should be reviewed as ‘okay’ and a movie with rating greater than 6 should be reviewed as ‘good’. The result should be sorted by the title (descending order) (Hint: The CASE function may come in handy)

In [70]:
## Answer for Part 3 Question 1
p3q1 = """
SELECT t.primary_title, r.avg_rating,
CASE
WHEN r.avg_rating <= 3 THEN 'poor'
WHEN r.avg_rating <= 6 THEN 'okay'
ELSE 'good'
END AS reviews
FROM titles t
JOIN ratings r ON r.tconst = t.tconst
WHERE t.type = 'movie'
ORDER BY t.primary_title DESC
LIMIT 20
"""
# all are movies but in case

# For testing
query_sql(p3q1)

                                   primary_title  avg_rating reviews
0                             Üç Harfliler: Adak         6.0    okay
1                                     Üres lovak         7.4    good
2   Özgürlesen Seyirci: Emek Sinemasi Mücadelesi         6.5    good
3                                    Özgür Dünya         2.2    poor
4                                   Õigus õnnele         4.4    okay
5                                        Òlòturé         5.5    okay
6                 În cautarea fotbalului pierdut         8.8    good
7                                   Étangs Noirs         6.6    good
8                             Çilli Yavrum Çilli         5.0    okay
9                                          Ámbar         4.9    okay
10              À tous ceux qui ne me lisent pas         7.1    good
11                              ¡Ánimo Juventud!         7.1    good
12                          ¡Viva el palíndromo!         7.3    good
13                                  ¡Ay, Carmen!         6.8    good
14                                  ¡Asu Mare! 3         4.9    okay
15                                     vajau ka?         7.5    good
16                                           ism         7.6    good
17                                iSmart Shankar         5.6    okay
18                           iPartment the Movie         2.4    poor
19                                       iIsland         8.3    good

2. Write a SQL query that returns the decades and percentage of titles which were released in the corresponding decade.

In [109]:
## Answer for Part 3 Question 2
p3q2 = """
WITH total_count AS (
SELECT COUNT(*) AS count 
FROM titles 
WHERE start_year IS NOT NULL
),
decades AS (
SELECT (start_year / 10) * 10 AS decade,
COUNT(*) AS count
FROM titles
WHERE start_year IS NOT NULL
GROUP BY decade
)
SELECT d.decade, (d.count * 100.0 / t.count) AS percent
FROM decades d, total_count t
ORDER BY d.decade
"""

# For testing
query_sql(p3q2)

    decade    percent
0     1910   0.441562
1     1920   3.366910
2     1930   2.152615
3     1940   0.890023
4     1950   1.379881
5     1960   2.870153
6     1970  10.528495
7     1980   3.911964
8     1990   2.166414
9     2000   4.305230
10    2010  58.272389
11    2020   9.714365

3. Write a SQL query that returns the name of director and a boolean value if the director has directed more than or equal to 5 movies. The boolean value will be 1 if true else 0.

In [85]:
## Answer for Part 3 Question 3
p3q3 = """
WITH movie_counts AS (
SELECT n.nconst, n.primary_name,
COUNT(DISTINCT c.tconst) AS movie_count
FROM names n
JOIN crews c ON c.director = n.nconst
GROUP BY n.nconst, n.primary_name
)
SELECT primary_name,
CASE
WHEN movie_count >=5 THEN 1 ELSE 0
END AS directed_five
FROM movie_counts
ORDER BY primary_name
"""

# For testing
query_sql(p3q3)

               primary_name  directed_five
0                A. Flintov              0
1            A. Jagannathan              0
2                   A. Joji              0
3      A. Kodandarami Reddy              0
4        A. Razak Mohaideen              0
...                     ...            ...
14809         Özer Kiziltan              0
14810         Özgür Dogruöz              0
14811        Øystein Hallre              0
14812         Ülkü Erakalin              0
14813    Þórunn Lárusdóttir              0

[14814 rows x 2 columns]

## **Submission**

To submit this assignment, run the cell below. It will create a zip file called `submit-me.zip` in this assignment's root directory. This zip contains all the queries you created in this notebook.

Then, submit this `submit-me.zip` file to Gradescope under "Assignment 2: SQL" (using the "Upload" option, not submitting through GitHub).

In [108]:
import os, shutil
result = [p1q1, p1q2, p1q3, p1q4, p1q5, p2q1, p2q2, p2q3, p3q1, p3q2, p3q3]
filenames = ["1_1", "1_2", "1_3", "1_4", "1_5", "2_1", "2_2", "2_3", "3_1", "3_2", "3_3"]
working_dir = "temp"
zip_path = "../submit-me.zip"
if os.path.exists(zip_path):
    os.remove(zip_path)
os.makedirs(working_dir, exist_ok=True)

for i in range(len(result)):
    with open(working_dir + os.sep + filenames[i] + '.sql', 'w') as file:
        file.write(result[i])

!zip -j ../submit-me.zip {working_dir}/*
shutil.rmtree(working_dir)

  adding: 1_1.sql (deflated 25%)
  adding: 1_2.sql (deflated 21%)
  adding: 1_3.sql (deflated 30%)
  adding: 1_4.sql (deflated 25%)
  adding: 1_5.sql (deflated 23%)
  adding: 2_1.sql (deflated 32%)
  adding: 2_2.sql (deflated 39%)
  adding: 2_3.sql (deflated 47%)
  adding: 3_1.sql (deflated 32%)
  adding: 3_2.sql (deflated 48%)
  adding: 3_3.sql (deflated 39%)

## **END OF THE ASSIGNMENT**

If you pass everything, Congrats! You've learned how to write SQL queries from the basic to complex structure which would be essential for working with databases!!